In [8]:
import pandas as pd
import numpy as np

# ðŸŸ¦ PART 1: Pandas Series â€“ 15 Questions

## ðŸ”¹ Basic Series Creation

#### 1.	Create a Series from a list [10, 20, 30, 40].

In [14]:
series1 = pd.Series([10,20,30,40])
series1

0    10
1    20
2    30
3    40
dtype: int64

#### 2.	Create a Series from a tuple ('a', 'b', 'c').

In [17]:
series2 = pd.Series(('a','b','c'))
series2

0    a
1    b
2    c
dtype: object

#### 3.	Create a Series from a dictionary {'a': 1, 'b': 2, 'c': 3}.

In [20]:
sereis3 = pd.Series({'a':1,'b':2, 'c':3})
sereis3

a    1
b    2
c    3
dtype: int64

#### 4.	Create a Series with custom index labels: ['x', 'y', 'z'] for values [100, 200, 300].

In [23]:
sereies4 = pd.Series([100,200,300],index = ['x','y','z'])
sereies4

x    100
y    200
z    300
dtype: int64

#### 5.	Create a Series with default index using range(4).

In [26]:
sereis5 = pd.Series(range(4))
sereis5

0    0
1    1
2    2
3    3
dtype: int64

## ðŸ”¹ Series Operations

#### 6.	Add two Series: [1, 2, 3] + [4, 5, 6].

In [30]:
series_a = pd.Series([1,2,3])
series_b = pd.Series([4,5,6])
series_a + series_b

0    5
1    7
2    9
dtype: int64

#### 7.	Multiply Series [2, 4, 6] by 3.

In [33]:
multiply_sereis = pd.Series([2,4,6]) *3
multiply_sereis

0     6
1    12
2    18
dtype: int64

#### 8.	Access the second element of Series [10, 20, 30, 40].

In [36]:
second_series = pd.Series([10,20,30,40])
second_series[1]

20

#### 9.	Slice the Series from index 1 to 3 (inclusive).

In [39]:
slice_series = pd.Series([10, 20, 30, 40])
slice_series[1:4]

1    20
2    30
3    40
dtype: int64

#### 10. Check if 'b' is an index in the Series {'a': 1, 'b': 2, 'c': 3}.

In [42]:
series_10 = pd.Series({'a': 1, 'b': 2, 'c': 3})
is_b_in_index = 'b' in series_10.index
is_b_in_index

True

## ðŸ”¹ Series Attributes & Methods

#### 11. Get the values and index of a Series.

In [46]:
print(series_10.values)
print(series_10.index)

[1 2 3]
Index(['a', 'b', 'c'], dtype='object')

#### 12. Convert a Series to a list.

In [49]:
series_10.tolist()

[1, 2, 3]

#### 13. Find the max and min of Series [10, 20, 5, 3].

In [52]:
series_13 = pd.Series([10,20,5,3])
print(series_13.max())
print(series_13.min())

20
3

#### 14. Sort a Series in descending order.

In [55]:
series_13.sort_values(ascending=False)

1    20
0    10
2     5
3     3
dtype: int64

#### 15. Apply a lambda function to square all elements in a Series.

In [58]:
series_13.apply(lambda x : x**2)

0    100
1    400
2     25
3      9
dtype: int64

# ðŸŸ¨ PART 2: Creating DataFrames from Lists, Dicts, Arrays â€“ 25 Questions

## ðŸ”¹ From List of Lists

#### 1.	Create a DataFrame from [[1, 'A'], [2, 'B'], [3, 'C']] with columns 'ID', 'Grade'.

In [65]:
dataFrame_1 = pd.DataFrame([[1, 'A'], [2, 'B'], [3, 'C']], columns=['ID', 'Grade'])
dataFrame_1

   ID Grade
0   1     A
1   2     B
2   3     C

#### 2.	Create a DataFrame from a 2D list with 4 rows and 3 columns, and add custom column names.

In [68]:
dataframe_2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=['X', 'Y', 'Z'])
dataframe_2

    X   Y   Z
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

#### 3.	Create a DataFrame from nested list with missing values (use None).

In [71]:
dataFrame_3 = pd.DataFrame([[1, 2], [3, None], [None, 4]])
dataFrame_3

     0    1
0  1.0  2.0
1  3.0  NaN
2  NaN  4.0

#### 4.	Create a DataFrame from list of lists and assign custom row index.

In [76]:
dataFrame_4 = pd.DataFrame([[1, 'A'], [2, 'B']], index=['r1', 'r2'], columns=['Num', 'Char'])
dataFrame_4

    Num Char
r1    1    A
r2    2    B

#### 5.	Access the second row from the created DataFrame.

In [79]:
dataFrame_1.iloc[1]

ID       2
Grade    B
Name: 1, dtype: object

## ðŸ”¹ From List of Dictionaries

#### 6.	Create a DataFrame from [{'a': 1, 'b': 2}, {'a': 3, 'b': 4}].

In [83]:
dataFrame_6 = pd.DataFrame([{'a': 1, 'b': 2}, {'a': 3, 'b': 4}])
dataFrame_6

   a  b
0  1  2
1  3  4

#### 7.	Create a DataFrame from list of dicts with missing keys.

In [86]:
dataframe_7 = pd.DataFrame([{'a': 1}, {'b': 2}])
dataframe_7

     a    b
0  1.0  NaN
1  NaN  2.0

#### 8.	Change the column order in the DataFrame.

In [89]:
dataFrame_8 = dataFrame_6[['b', 'a']]
dataFrame_8

   b  a
0  2  1
1  4  3

#### 9.	Create a DataFrame from list of dicts and rename the columns.

In [92]:
dataFrame_9 = dataFrame_6.rename(columns={'a': 'A1', 'b': 'B1'})
dataFrame_9

   A1  B1
0   1   2
1   3   4

#### 10. Access a specific cell (row 1, column 'a').

In [95]:
cell_value = dataFrame_6.loc[1, 'a']
cell_value

3

## ðŸ”¹ From Dictionary of Lists

#### 11.Create a DataFrame from:
{
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
}

In [99]:
df11 = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
})
df11

    Name  Age
0  Alice   25
1    Bob   30

#### 12. Add a new column 'City' with values ['Delhi', 'Mumbai'].

In [102]:
df11['City'] = ['Delhi', 'Mumbai']
df11

    Name  Age    City
0  Alice   25   Delhi
1    Bob   30  Mumbai

#### 13. Change the index to ['emp1', 'emp2'].

In [105]:
df11.index= ['emp1','emp2']
df11

       Name  Age    City
emp1  Alice   25   Delhi
emp2    Bob   30  Mumbai

#### 14. Get the shape of the DataFrame.

In [108]:
df11.shape

(2, 3)

#### 15. Drop the column 'Age'.

In [111]:
df11.drop('Age',axis=1)

       Name    City
emp1  Alice   Delhi
emp2    Bob  Mumbai

## ðŸ”¹ From NumPy Arrays

#### 16. Create a 2x3 numpy array and convert to DataFrame.

In [117]:
arr16 = np.array([[1,2,3], [4,5,6]])
df16 = pd.DataFrame(arr16)
df16

   0  1  2
0  1  2  3
1  4  5  6

#### 17. Add column names to the DataFrame created from numpy array.

In [120]:
df17 = pd.DataFrame(arr16, columns=['A', 'B', 'C'])
df17

   A  B  C
0  1  2  3
1  4  5  6

#### 18. Create a DataFrame from np.arange(12).reshape(3, 4).

In [123]:
df18 = pd.DataFrame(np.arange(12).reshape(3,4), columns=['A', 'B', 'C', 'D'])
df18

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

#### 19. Access the last row of the numpy-generated DataFrame.

In [126]:
last_row = df18.iloc[-1]
last_row

A     8
B     9
C    10
D    11
Name: 2, dtype: int32

#### 20. Convert the DataFrame to a numpy array back.

In [129]:
array_back = df18.to_numpy()
array_back

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

## ðŸ”¹ Mixed Tasks

#### 21. Create an empty DataFrame and then add a column.

In [135]:
df21 = pd.DataFrame()
df21['Col1'] = [1, 2, 3]
df21

   Col1
0     1
1     2
2     3

#### 22. Create a DataFrame from a list of tuples with column names.

In [138]:
data22 = [(1, 'Alice'), (2, 'Bob')]
df22 = pd.DataFrame(data22, columns=['ID', 'Name'])
df22

   ID   Name
0   1  Alice
1   2    Bob

#### 23. Create a DataFrame from a scalar value repeated for 5 rows and 2 columns.

In [141]:
df23 = pd.DataFrame(5, index=range(5), columns=['A', 'B'])
df23

   A  B
0  5  5
1  5  5
2  5  5
3  5  5
4  5  5

#### 24. Create a DataFrame using dictionary with Series as values.

In [144]:
df24 = pd.DataFrame({
    'X': pd.Series([1, 2, 3]),
    'Y': pd.Series([4, 5, 6])
})
df24

   X  Y
0  1  4
1  2  5
2  3  6

#### 25. Create a DataFrame using .from_dict() method with orient='index'.

In [147]:
data25 = {'row1': {'A': 1, 'B': 2}, 'row2': {'A': 3, 'B': 4}}
df25 = pd.DataFrame.from_dict(data25, orient='index')
df25

      A  B
row1  1  2
row2  3  4